Revit 2027 API
ParameterTypeId.AreaType Property
 "Area Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AreaType { get; }
Public Shared ReadOnly Property AreaType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AreaType {
	ForgeTypeId^ get ();
}
static member AreaType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace